OF21x/ALM11/constant/airfoilProperties/DU238-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.0210511111111111 )
( -175 0.356666666666667 0.0343822222222222 )
( -170 0.713022222222222 0.0952155555555556 )
( -160 0.674666666666667 0.282984444444444 )
( -155 0.754288888888889 0.396093333333333 )
( -150 0.802911111111111 0.514933333333333 )
( -145 0.8236 0.635411111111111 )
( -140 0.818911111111111 0.75382 )
( -135 0.7916 0.867266666666667 )
( -130 0.744288888888889 0.973251111111111 )
( -125 0.679666666666667 1.06984222222222 )
( -120 0.600044444444444 1.15550222222222 )
( -115 0.508111111111111 1.22893777777778 )
( -110 0.405488888888889 1.28918 )
( -105 0.295866666666667 1.33542888888889 )
( -100 0.179933333333333 1.36731555555556 )
( -95 0.0603111111111111 1.38440888888889 )
( -90 -0.0603111111111111 1.38660888888889 )
( -85 -0.180244444444444 1.37391555555556 )
( -80 -0.297177777777778 1.34656 )
( -75 -0.4098 1.30484888888889 )
( -70 -0.515422222222222 1.24920666666667 )
( -65 -0.612355555555556 1.18037111111111 )
( -60 -0.697666666666667 1.09927333333333 )
( -55 -0.769288888888889 1.00698222222222 )
( -50 -0.8256 0.905128888888889 )
( -45 -0.863222222222222 0.795413333333333 )
( -40 -0.881222222222222 0.680066666666667 )
( -35 -0.875222222222222 0.561757777777778 )
( -30 -0.844222222222222 0.443548888888889 )
( -25 -0.803755555555556 0.328742222222222 )
( -24 -0.812044444444444 0.305468888888889 )
( -23 -0.828955555555556 0.281924444444444 )
( -22 -0.851488888888889 0.258253333333333 )
( -21 -0.880333333333333 0.234555555555556 )
( -20 -0.9138 0.2109 )
( -19 -0.951266666666667 0.187493333333333 )
( -18 -0.991355555555556 0.164335555555556 )
( -17 -1.03275555555556 0.141602222222222 )
( -16 -1.07553333333333 0.119324444444444 )
( -15.25 -1.1071 0.103089444444444 )
( -14.24 -1.0987114680946 0.0823841410084784 )
( -13.24 -1.04667523427041 0.0680349397590362 )
( -12.22 -0.989435609103079 0.0530863989290495 )
( -11.22 -0.928175137513751 0.047957601760176 )
( -10.19 -0.849798039215686 0.0430202614379085 )
( -9.7 -0.795266666666666 0.0393607407407407 )
( -9.18 -0.722733333333333 0.0337637037037037 )
( -8.18 -0.610911111111111 0.0173044444444444 )
( -7.19 -0.49339651416122 0.0121214814814815 )
( -6.65 -0.418883224400872 0.0109430065359477 )
( -6.13 -0.349221333333333 0.0105031555555556 )
( -6 -0.332111111111111 0.00928888888888889 )
( -5.5 -0.262933333333333 0.00836444444444445 )
( -5 -0.196688888888889 0.00777111111111111 )
( -4.5 -0.130755555555556 0.00734 )
( -4 -0.0670666666666667 0.00717111111111111 )
( -3.5 -0.00368888888888891 0.00697111111111111 )
( -3 0.0625555555555555 0.00676444444444444 )
( -2.5 0.127422222222222 0.00666444444444445 )
( -2 0.191288888888889 0.00666444444444445 )
( -1.5 0.255844444444444 0.00666444444444445 )
( -1 0.320088888888889 0.00666444444444445 )
( -0.5 0.383644444444444 0.00666444444444445 )
( 0 0.448511111111111 0.00663333333333333 )
( 0.5 0.511755555555556 0.00663333333333333 )
( 1 0.575311111111111 0.00673333333333333 )
( 1.5 0.637866666666667 0.00676444444444444 )
( 2 0.701422222222222 0.00686444444444444 )
( 2.5 0.762977777777778 0.00703333333333333 )
( 3 0.824844444444444 0.00720222222222222 )
( 3.5 0.886088888888889 0.00744 )
( 4 0.939688888888889 0.00784666666666667 )
( 4.5 0.994044444444445 0.00842888888888889 )
( 5 1.04802222222222 0.00921777777777778 )
( 5.5 1.10237777777778 0.0101755555555556 )
( 6 1.15466666666667 0.0109266666666667 )
( 6.5 1.20664444444444 0.0116088888888889 )
( 7 1.25624444444444 0.0123533333333333 )
( 7.5 1.30284444444444 0.01306 )
( 8 1.34151111111111 0.0140155555555556 )
( 9 1.39895555555556 0.0172911111111111 )
( 9.5 1.40815555555556 0.0198555555555556 )
( 10 1.38911111111111 0.02354 )
( 10.5 1.36744444444444 0.0275488888888889 )
( 11 1.357 0.0318377777777778 )
( 11.5 1.35457777777778 0.0371755555555556 )
( 12 1.35817777777778 0.0437511111111111 )
( 12.5 1.36166666666667 0.0516066666666667 )
( 13 1.33428888888889 0.0632066666666667 )
( 13.5 1.31188888888889 0.0741288888888889 )
( 14 1.29751111111111 0.0844888888888889 )
( 14.5 1.2926 0.0956311111111111 )
( 15 1.29304444444444 0.10654 )
( 15.5 1.295 0.118077777777778 )
( 16 1.298 0.130128888888889 )
( 16.5 1.30533333333333 0.141715555555556 )
( 17 1.31066666666667 0.153444444444444 )
( 17.5 1.31515555555556 0.164444444444444 )
( 18 1.31577777777778 0.175613333333333 )
( 18.5 1.31795555555556 0.186933333333333 )
( 19 1.3248 0.198311111111111 )
( 19.5 1.33033333333333 0.209764444444444 )
( 20 1.33806666666667 0.22054 )
( 20.5 1.35642222222222 0.232213333333333 )
( 21 1.35915555555556 0.24408 )
( 22 1.32086666666667 0.27314 )
( 23 1.28126666666667 0.302586666666667 )
( 24 1.24235555555556 0.332526666666667 )
( 25 1.20382222222222 0.362828888888889 )
( 26 1.16735555555556 0.393155555555556 )
( 28 1.10286666666667 0.453751111111111 )
( 30 1.05626666666667 0.513344444444444 )
( 32 1.03531111111111 0.570942222222222 )
( 35 1.04562222222222 0.653486666666667 )
( 40 1.04582222222222 0.788568888888889 )
( 45 1.01791111111111 0.917646666666667 )
( 50 0.965511111111111 1.03736666666667 )
( 55 0.891933333333333 1.14473777777778 )
( 60 0.799733333333333 1.23718666666667 )
( 65 0.6936 1.31303333333333 )
( 70 0.5764 1.37089111111111 )
( 75 0.451133333333333 1.41010888888889 )
( 80 0.322044444444444 1.43084 )
( 85 0.192066666666667 1.43523777777778 )
( 90 0.0651333333333333 1.43334222222222 )
( 95 -0.0596222222222222 1.43129333333333 )
( 100 -0.183066666666667 1.41396888888889 )
( 105 -0.302822222222222 1.3814 )
( 110 -0.416888888888889 1.33392444444444 )
( 115 -0.522955555555556 1.27207333333333 )
( 120 -0.618644444444444 1.19655333333333 )
( 125 -0.701333333333333 1.10829555555556 )
( 130 -0.768333333333333 1.00873777777778 )
( 135 -0.817644444444444 0.899348888888889 )
( 140 -0.846266666666667 0.782197777777778 )
( 145 -0.8522 0.659753333333333 )
( 150 -0.831444444444444 0.53516 )
( 155 -0.781 0.41198 )
( 160 -0.699177777777778 0.294626666666667 )
( 170 -0.713022222222222 0.0994511111111111 )
( 175 -0.356666666666667 0.03508 )
( 180 0 0.0210511111111111 )
); // // // //
