OF21x/ALM11/constant/airfoilProperties/DU430-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.07469 )
( -175 0.2071 0.083905 )
( -170 0.37715 0.122665 )
( -160 0.6099 0.306775 )
( -155 0.67925 0.414505 )
( -150 0.71915 0.526225 )
( -145 0.7334 0.638325 )
( -140 0.7239 0.747575 )
( -135 0.69445 0.851315 )
( -130 0.646 0.94736 )
( -125 0.58235 1.034 )
( -120 0.5054 1.109905 )
( -115 0.41705 1.17403 )
( -110 0.32015 1.22552 )
( -105 0.2166 1.26371 )
( -100 0.1083 1.28841 )
( -95 -0.0019 1.29924 )
( -90 -0.114 1.2962 )
( -85 -0.2242 1.279385 )
( -80 -0.33155 1.24908 )
( -75 -0.4332 1.205665 )
( -70 -0.52915 1.14971 )
( -65 -0.61465 1.08188 )
( -60 -0.69065 1.00322 )
( -55 -0.7524 0.91487 )
( -50 -0.7999 0.818255 )
( -45 -0.8303 0.715275 )
( -40 -0.8417 0.607925 )
( -35 -0.83125 0.498865 )
( -30 -0.79705 0.39104 )
( -25 -0.73815 0.288155 )
( -24 -0.72295 0.26849 )
( -23 -0.7068 0.2493 )
( -22 -0.68875 0.23049 )
( -21 -0.6707 0.212155 )
( -20 -0.65075 0.194295 )
( -19 -0.6289 0.177765 )
( -18 -0.60325 0.163135 )
( -17 -0.57475 0.15031 )
( -16 -0.54245 0.139195 )
( -15 -0.5073 0.129885 )
( -14 -0.4693 0.122095 )
( -13 -0.4294 0.11592 )
( -12 -0.38665 0.11117 )
( -11 -0.342 0.107845 )
( -10 -0.29545 0.105945 )
( -8 -0.1976 0.10585 )
( -6 -0.10545 0.082955 )
( -5.5 -0.0855 0.07583 )
( -5 -0.0684 0.069465 )
( -4.5 -0.06175 0.0631 )
( -4 -0.0513 0.056545 )
( -3.5 -0.01615 0.050655 )
( -3 0.00285 0.045905 )
( -2.5 0.0133 0.041725 )
( -2 0.00855 0.03631 )
( -1.5 0.0038 0.03308 )
( -1 0.0342 0.031465 )
( -0.5 0.06935 0.030515 )
( 0 0.13015 0.028235 )
( 0.5 0.20235 0.02833 )
( 1 0.2774 0.02871 )
( 1.5 0.35055 0.02909 )
( 2 0.4218 0.02928 )
( 2.5 0.4883 0.02928 )
( 3 0.551 0.029185 )
( 3.5 0.61275 0.0289 )
( 4 0.6745 0.028805 )
( 4.5 0.7372 0.02909 )
( 5 0.79895 0.029375 )
( 5.5 0.8588 0.029755 )
( 6 0.91865 0.030325 )
( 6.5 0.97565 0.03118 )
( 7 1.0298 0.03251 )
( 7.5 1.083 0.03403 )
( 8 1.13335 0.03631 )
( 8.5 1.1799 0.039445 )
( 9 1.22265 0.043625 )
( 9.5 1.26635 0.048185 )
( 10 1.2996 0.054835 )
( 10.5 1.33 0.062625 )
( 11 1.35375 0.0726 )
( 11.5 1.37655 0.083145 )
( 12 1.39935 0.09502 )
( 12.5 1.4193 0.109935 )
( 13 1.43735 0.124755 )
( 13.5 1.4611 0.13986 )
( 14.5 1.50765 0.17425 )
( 15 1.5333 0.192775 )
( 15.5 1.54945 0.21244 )
( 16 1.56655 0.23125 )
( 16.5 1.5827 0.251865 )
( 17 1.59695 0.27248 )
( 17.5 1.61405 0.293 )
( 18 1.63305 0.313995 )
( 19 1.66345 0.35513 )
( 19.5 1.67865 0.376885 )
( 20.5 1.7081 0.41764 )
( 21 1.7195 0.436925 )
( 22 1.7385 0.47635 )
( 23 1.75465 0.516915 )
( 24 1.76795 0.55843 )
( 25 1.7784 0.600895 )
( 26 1.78695 0.643835 )
( 28 1.7993 0.731235 )
( 30 1.8088 0.819395 )
( 32 1.81925 0.90708 )
( 35 1.83255 1.03609 )
( 40 1.80785 1.240435 )
( 45 1.729 1.42312 )
( 50 1.6055 1.575595 )
( 55 1.4459 1.690355 )
( 60 1.25685 1.7617 )
( 65 1.0507 1.78583 )
( 70 0.836 1.760465 )
( 75 0.6251 1.686365 )
( 80 0.42655 1.56923 )
( 85 0.25365 1.427965 )
( 90 0.1178 1.336005 )
( 95 0.0019 1.33914 )
( 100 -0.1121 1.328025 )
( 105 -0.22325 1.30266 )
( 110 -0.3306 1.26333 )
( 115 -0.43035 1.210415 )
( 120 -0.52155 1.14458 )
( 125 -0.60135 1.066395 )
( 130 -0.6669 0.97719 )
( 135 -0.7163 0.8782 )
( 140 -0.74765 0.771325 )
( 145 -0.75715 0.65875 )
( 150 -0.7429 0.54304 )
( 155 -0.70205 0.42771 )
( 160 -0.6308 0.316465 )
( 170 -0.3895 0.12618 )
( 175 -0.2147 0.08419 )
( 180 0 0.07469 )
); // // // //
