OF21x/ALM11/constant/airfoilProperties/DU477-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.097391 )
( -175 0.190023333333333 0.105846166666667 )
( -170 0.346051666666667 0.141410166666667 )
( -160 0.55961 0.310339166666667 )
( -155 0.623241666666667 0.409186166666667 )
( -150 0.659851666666667 0.511694166666667 )
( -145 0.672926666666667 0.614550833333333 )
( -140 0.66421 0.7147925 )
( -135 0.637188333333333 0.8099785 )
( -130 0.592733333333333 0.898104 )
( -125 0.534331666666667 0.9776 )
( -120 0.463726666666667 1.04724616666667 )
( -115 0.382661666666667 1.10608366666667 )
( -110 0.293751666666667 1.153328 )
( -105 0.19874 1.188369 )
( -100 0.09937 1.21103233333333 )
( -95 -0.00174333333333333 1.22096933333333 )
( -90 -0.1046 1.21818 )
( -85 -0.205713333333333 1.2027515 )
( -80 -0.304211666666667 1.17494533333333 )
( -75 -0.39748 1.13511016666667 )
( -70 -0.485518333333333 1.083769 )
( -65 -0.563968333333333 1.021532 )
( -60 -0.633701666666667 0.949358 )
( -55 -0.69036 0.868293 )
( -50 -0.733943333333333 0.7796445 )
( -45 -0.761836666666667 0.685155833333333 )
( -40 -0.772296666666667 0.5866575 )
( -35 -0.762708333333333 0.486590166666667 )
( -30 -0.731328333333333 0.387656 )
( -25 -0.677285 0.2932545 )
( -24 -0.663338333333333 0.275211 )
( -23 -0.64852 0.257603333333333 )
( -22 -0.631958333333333 0.240344333333333 )
( -21 -0.615396666666667 0.223521166666667 )
( -20 -0.597091666666667 0.207133833333333 )
( -19 -0.577043333333333 0.191966833333333 )
( -18 -0.553508333333333 0.178543166666667 )
( -17 -0.527358333333333 0.166775666666667 )
( -16 -0.497721666666667 0.156577166666667 )
( -15 -0.46547 0.148034833333333 )
( -14 -0.430603333333333 0.140887166666667 )
( -13 -0.393993333333333 0.135221333333333 )
( -12 -0.354768333333333 0.130863 )
( -11 -0.3138 0.127812166666667 )
( -10 -0.271088333333333 0.126068833333333 )
( -8 -0.181306666666667 0.125981666666667 )
( -6 -0.096755 0.1049745 )
( -5.5 -0.07845 0.098437 )
( -5 -0.06276 0.0925968333333334 )
( -4.5 -0.0566583333333333 0.0867566666666667 )
( -4 -0.04707 0.0807421666666667 )
( -3.5 -0.0148183333333333 0.0753378333333334 )
( -3 0.002615 0.0709795 )
( -2.5 0.0122033333333333 0.0671441666666667 )
( -2 0.007845 0.0621756666666667 )
( -1.5 0.00348666666666667 0.059212 )
( -1 0.03138 0.0577301666666667 )
( -0.5 0.0636316666666667 0.0568585 )
( 0 0.119418333333333 0.0547665 )
( 0.5 0.185665 0.0548536666666667 )
( 1 0.254526666666667 0.0552023333333333 )
( 1.5 0.321645 0.055551 )
( 2 0.38702 0.0557253333333333 )
( 2.5 0.448036666666667 0.0557253333333333 )
( 3 0.505566666666667 0.0556381666666667 )
( 3.5 0.562225 0.0553766666666667 )
( 4 0.618883333333333 0.0552895 )
( 4.5 0.676413333333333 0.055551 )
( 5 0.733071666666667 0.0558125 )
( 5.5 0.787986666666667 0.0561611666666667 )
( 6 0.842901666666667 0.0566841666666667 )
( 6.5 0.895201666666667 0.0574686666666667 )
( 7 0.944886666666667 0.058689 )
( 7.5 0.9937 0.0600836666666667 )
( 8 1.03989833333333 0.0621756666666667 )
( 8.5 1.08261 0.0650521666666667 )
( 9 1.121835 0.0688875 )
( 9.5 1.16193166666667 0.0730715 )
( 10 1.19244 0.0791731666666667 )
( 10.5 1.22033333333333 0.0863208333333333 )
( 11 1.242125 0.0954733333333334 )
( 11.5 1.263045 0.105148833333333 )
( 12 1.283965 0.116044666666667 )
( 12.5 1.30227 0.129729833333333 )
( 13 1.31883166666667 0.143327833333333 )
( 13.5 1.34062333333333 0.157187333333333 )
( 14.5 1.383335 0.188741666666667 )
( 15 1.40687 0.205739166666667 )
( 15.5 1.42168833333333 0.223782666666667 )
( 16 1.43737833333333 0.241041666666667 )
( 16.5 1.45219666666667 0.259956833333333 )
( 17 1.46527166666667 0.278872 )
( 17.5 1.48096166666667 0.2977 )
( 18 1.498395 0.316963833333333 )
( 19 1.52628833333333 0.354707 )
( 19.5 1.540235 0.374668166666667 )
( 20.5 1.56725666666667 0.412062666666667 )
( 21 1.57771666666667 0.4297575 )
( 22 1.59515 0.465931666666667 )
( 23 1.60996833333333 0.503151833333333 )
( 24 1.62217166666667 0.541243666666667 )
( 25 1.63176 0.580207166666667 )
( 26 1.639605 0.6196065 )
( 28 1.65093666666667 0.699799833333333 )
( 30 1.65965333333333 0.7806905 )
( 32 1.66924166666667 0.861145333333333 )
( 35 1.681445 0.979517666666667 )
( 40 1.65878166666667 1.16701316666667 )
( 45 1.58643333333333 1.33463466666667 )
( 50 1.47311666666667 1.47453716666667 )
( 55 1.32667666666667 1.5798345 )
( 60 1.153215 1.64529666666667 )
( 65 0.964063333333333 1.667437 )
( 70 0.767066666666667 1.6441635 )
( 75 0.573556666666667 1.5761735 )
( 80 0.391378333333333 1.468697 )
( 85 0.232735 1.33908016666667 )
( 90 0.108086666666667 1.25470283333333 )
( 95 0.00174333333333333 1.25757933333333 )
( 100 -0.102856666666667 1.24738083333333 )
( 105 -0.204841666666667 1.22410733333333 )
( 110 -0.30334 1.18802033333333 )
( 115 -0.394865 1.1394685 )
( 120 -0.478545 1.079062 )
( 125 -0.551765 1.00732383333333 )
( 130 -0.61191 0.925474333333333 )
( 135 -0.657236666666667 0.834646666666667 )
( 140 -0.686001666666667 0.736584166666667 )
( 145 -0.694718333333333 0.633291666666667 )
( 150 -0.681643333333333 0.527122666666667 )
( 155 -0.644161666666667 0.421302333333333 )
( 160 -0.578786666666667 0.319230166666667 )
( 170 -0.357383333333333 0.144635333333333 )
( 175 -0.196996666666667 0.106107666666667 )
( 180 0 0.097391 )
); // // // //
