OF21x/ALM11/constant/airfoilProperties/DU610-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.16163 )
( -175 0.1417 0.167935 )
( -170 0.25805 0.194455 )
( -160 0.4173 0.320425 )
( -155 0.46475 0.394135 )
( -150 0.49205 0.470575 )
( -145 0.5018 0.547275 )
( -140 0.4953 0.622025 )
( -135 0.47515 0.693005 )
( -130 0.442 0.75872 )
( -125 0.39845 0.818 )
( -120 0.3458 0.869935 )
( -115 0.28535 0.91381 )
( -110 0.21905 0.94904 )
( -105 0.1482 0.97517 )
( -100 0.0741 0.99207 )
( -95 -0.0013 0.99948 )
( -90 -0.078 0.9974 )
( -85 -0.1534 0.985895 )
( -80 -0.22685 0.96516 )
( -75 -0.2964 0.935455 )
( -70 -0.36205 0.89717 )
( -65 -0.42055 0.85076 )
( -60 -0.47255 0.79694 )
( -55 -0.5148 0.73649 )
( -50 -0.5473 0.670385 )
( -45 -0.5681 0.599925 )
( -40 -0.5759 0.526475 )
( -35 -0.56875 0.451855 )
( -30 -0.54535 0.37808 )
( -25 -0.50505 0.307685 )
( -24 -0.49465 0.29423 )
( -23 -0.4836 0.2811 )
( -22 -0.47125 0.26823 )
( -21 -0.4589 0.255685 )
( -20 -0.44525 0.243465 )
( -19 -0.4303 0.232155 )
( -18 -0.41275 0.222145 )
( -17 -0.39325 0.21337 )
( -16 -0.37115 0.205765 )
( -15 -0.3471 0.199395 )
( -14 -0.3211 0.194065 )
( -13 -0.2938 0.18984 )
( -12 -0.26455 0.18659 )
( -11 -0.234 0.184315 )
( -10 -0.20215 0.183015 )
( -8 -0.1352 0.18295 )
( -6 -0.07215 0.167285 )
( -5.5 -0.0585 0.16241 )
( -5 -0.0468 0.158055 )
( -4.5 -0.04225 0.1537 )
( -4 -0.0351 0.149215 )
( -3.5 -0.01105 0.145185 )
( -3 0.00195 0.141935 )
( -2.5 0.0091 0.139075 )
( -2 0.00585 0.13537 )
( -1.5 0.0026 0.13316 )
( -1 0.0234 0.132055 )
( -0.5 0.04745 0.131405 )
( 0 0.08905 0.129845 )
( 0.5 0.13845 0.12991 )
( 1 0.1898 0.13017 )
( 1.5 0.23985 0.13043 )
( 2 0.2886 0.13056 )
( 2.5 0.3341 0.13056 )
( 3 0.377 0.130495 )
( 3.5 0.41925 0.1303 )
( 4 0.4615 0.130235 )
( 4.5 0.5044 0.13043 )
( 5 0.54665 0.130625 )
( 5.5 0.5876 0.130885 )
( 6 0.62855 0.131275 )
( 6.5 0.66755 0.13186 )
( 7 0.7046 0.13277 )
( 7.5 0.741 0.13381 )
( 8 0.77545 0.13537 )
( 8.5 0.8073 0.137515 )
( 9 0.83655 0.140375 )
( 9.5 0.86645 0.143495 )
( 10 0.8892 0.148045 )
( 10.5 0.91 0.153375 )
( 11 0.92625 0.1602 )
( 11.5 0.94185 0.167415 )
( 12 0.95745 0.17554 )
( 12.5 0.9711 0.185745 )
( 13 0.98345 0.195885 )
( 13.5 0.9997 0.20622 )
( 14.5 1.03155 0.22975 )
( 15 1.0491 0.242425 )
( 15.5 1.06015 0.25588 )
( 16 1.07185 0.26875 )
( 16.5 1.0829 0.282855 )
( 17 1.09265 0.29696 )
( 17.5 1.10435 0.311 )
( 18 1.11735 0.325365 )
( 19 1.13815 0.35351 )
( 19.5 1.14855 0.368395 )
( 20.5 1.1687 0.39628 )
( 21 1.1765 0.409475 )
( 22 1.1895 0.43645 )
( 23 1.20055 0.464205 )
( 24 1.20965 0.49261 )
( 25 1.2168 0.521665 )
( 26 1.22265 0.551045 )
( 28 1.2311 0.610845 )
( 30 1.2376 0.671165 )
( 32 1.24475 0.73116 )
( 35 1.25385 0.81943 )
( 40 1.23695 0.959245 )
( 45 1.183 1.08424 )
( 50 1.0985 1.188565 )
( 55 0.9893 1.267085 )
( 60 0.85995 1.3159 )
( 65 0.7189 1.33241 )
( 70 0.572 1.315055 )
( 75 0.4277 1.264355 )
( 80 0.29185 1.18421 )
( 85 0.17355 1.087555 )
( 90 0.0806 1.024635 )
( 95 0.0013 1.02678 )
( 100 -0.0767 1.019175 )
( 105 -0.15275 1.00182 )
( 110 -0.2262 0.97491 )
( 115 -0.29445 0.938705 )
( 120 -0.35685 0.89366 )
( 125 -0.41145 0.840165 )
( 130 -0.4563 0.77913 )
( 135 -0.4901 0.7114 )
( 140 -0.51155 0.638275 )
( 145 -0.51805 0.56125 )
( 150 -0.5083 0.48208 )
( 155 -0.48035 0.40317 )
( 160 -0.4316 0.327055 )
( 170 -0.2665 0.19686 )
( 175 -0.1469 0.16813 )
( 180 0 0.16163 )
); // // // //
