OF21x/ALM11/constant/airfoilProperties/DU780-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.24374 )
( -175 0.0799333333333333 0.247296666666667 )
( -170 0.145566666666667 0.262256666666667 )
( -160 0.2354 0.333316666666667 )
( -155 0.262166666666667 0.374896666666667 )
( -150 0.277566666666667 0.418016666666667 )
( -145 0.283066666666667 0.461283333333333 )
( -140 0.2794 0.50345 )
( -135 0.268033333333333 0.54349 )
( -130 0.249333333333333 0.58056 )
( -125 0.224766666666667 0.614 )
( -120 0.195066666666667 0.643296666666667 )
( -115 0.160966666666667 0.668046666666667 )
( -110 0.123566666666667 0.68792 )
( -105 0.0836 0.70266 )
( -100 0.0418 0.712193333333333 )
( -95 -0.000733333333333333 0.716373333333333 )
( -90 -0.044 0.7152 )
( -85 -0.0865333333333333 0.70871 )
( -80 -0.127966666666667 0.697013333333333 )
( -75 -0.1672 0.680256666666667 )
( -70 -0.204233333333333 0.65866 )
( -65 -0.237233333333333 0.63248 )
( -60 -0.266566666666667 0.60212 )
( -55 -0.2904 0.56802 )
( -50 -0.308733333333333 0.53073 )
( -45 -0.320466666666667 0.490983333333333 )
( -40 -0.324866666666667 0.44955 )
( -35 -0.320833333333333 0.407456666666667 )
( -30 -0.307633333333333 0.36584 )
( -25 -0.2849 0.32613 )
( -24 -0.279033333333333 0.31854 )
( -23 -0.2728 0.311133333333333 )
( -22 -0.265833333333333 0.303873333333333 )
( -21 -0.258866666666667 0.296796666666667 )
( -20 -0.251166666666667 0.289903333333333 )
( -19 -0.242733333333333 0.283523333333333 )
( -18 -0.232833333333333 0.277876666666667 )
( -17 -0.221833333333333 0.272926666666667 )
( -16 -0.209366666666667 0.268636666666667 )
( -15 -0.1958 0.265043333333333 )
( -14 -0.181133333333333 0.262036666666667 )
( -13 -0.165733333333333 0.259653333333333 )
( -12 -0.149233333333333 0.25782 )
( -11 -0.132 0.256536666666667 )
( -10 -0.114033333333333 0.255803333333333 )
( -8 -0.0762666666666666 0.255766666666667 )
( -6 -0.0407 0.24693 )
( -5.5 -0.033 0.24418 )
( -5 -0.0264 0.241723333333333 )
( -4.5 -0.0238333333333333 0.239266666666667 )
( -4 -0.0198 0.236736666666667 )
( -3.5 -0.00623333333333333 0.234463333333333 )
( -3 0.0011 0.23263 )
( -2.5 0.00513333333333333 0.231016666666667 )
( -2 0.0033 0.228926666666667 )
( -1.5 0.00146666666666667 0.22768 )
( -1 0.0132 0.227056666666667 )
( -0.5 0.0267666666666667 0.22669 )
( 0 0.0502333333333333 0.22581 )
( 0.5 0.0781 0.225846666666667 )
( 1 0.107066666666667 0.225993333333333 )
( 1.5 0.1353 0.22614 )
( 2 0.1628 0.226213333333333 )
( 2.5 0.188466666666667 0.226213333333333 )
( 3 0.212666666666667 0.226176666666667 )
( 3.5 0.2365 0.226066666666667 )
( 4 0.260333333333333 0.22603 )
( 4.5 0.284533333333333 0.22614 )
( 5 0.308366666666667 0.22625 )
( 5.5 0.331466666666667 0.226396666666667 )
( 6 0.354566666666667 0.226616666666667 )
( 6.5 0.376566666666667 0.226946666666667 )
( 7 0.397466666666667 0.22746 )
( 7.5 0.418 0.228046666666667 )
( 8 0.437433333333333 0.228926666666667 )
( 8.5 0.4554 0.230136666666667 )
( 9 0.4719 0.23175 )
( 9.5 0.488766666666667 0.23351 )
( 10 0.5016 0.236076666666667 )
( 10.5 0.513333333333333 0.239083333333333 )
( 11 0.5225 0.242933333333333 )
( 11.5 0.5313 0.247003333333333 )
( 12 0.5401 0.251586666666667 )
( 12.5 0.5478 0.257343333333333 )
( 13 0.554766666666667 0.263063333333333 )
( 13.5 0.563933333333333 0.268893333333333 )
( 14.5 0.5819 0.282166666666667 )
( 15 0.5918 0.289316666666667 )
( 15.5 0.598033333333333 0.296906666666667 )
( 16 0.604633333333333 0.304166666666667 )
( 16.5 0.610866666666667 0.312123333333333 )
( 17 0.616366666666667 0.32008 )
( 17.5 0.622966666666667 0.328 )
( 18 0.6303 0.336103333333333 )
( 19 0.642033333333333 0.35198 )
( 19.5 0.6479 0.360376666666667 )
( 20.5 0.659266666666667 0.376106666666667 )
( 21 0.663666666666667 0.38355 )
( 22 0.671 0.398766666666667 )
( 23 0.677233333333333 0.414423333333333 )
( 24 0.682366666666667 0.430446666666667 )
( 25 0.6864 0.446836666666667 )
( 26 0.6897 0.46341 )
( 28 0.694466666666667 0.497143333333333 )
( 30 0.698133333333333 0.53117 )
( 32 0.702166666666667 0.565013333333333 )
( 35 0.7073 0.614806666666667 )
( 40 0.697766666666667 0.693676666666667 )
( 45 0.667333333333334 0.764186666666667 )
( 50 0.619666666666667 0.823036666666667 )
( 55 0.558066666666667 0.86733 )
( 60 0.4851 0.894866666666667 )
( 65 0.405533333333333 0.90418 )
( 70 0.322666666666667 0.89439 )
( 75 0.241266666666667 0.86579 )
( 80 0.164633333333333 0.82058 )
( 85 0.0979 0.766056666666667 )
( 90 0.0454666666666667 0.730563333333333 )
( 95 0.000733333333333333 0.731773333333333 )
( 100 -0.0432666666666667 0.727483333333333 )
( 105 -0.0861666666666667 0.717693333333333 )
( 110 -0.1276 0.702513333333333 )
( 115 -0.1661 0.68209 )
( 120 -0.2013 0.65668 )
( 125 -0.2321 0.626503333333333 )
( 130 -0.2574 0.592073333333333 )
( 135 -0.276466666666667 0.553866666666667 )
( 140 -0.288566666666667 0.512616666666667 )
( 145 -0.292233333333333 0.469166666666667 )
( 150 -0.286733333333333 0.424506666666667 )
( 155 -0.270966666666667 0.379993333333333 )
( 160 -0.243466666666667 0.337056666666667 )
( 170 -0.150333333333333 0.263613333333333 )
( 175 -0.0828666666666666 0.247406666666667 )
( 180 0 0.24374 )
); // // // //
