OF21x/ALM11/constant/airfoilProperties/DU930-OF
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//alpha   C_l      C_d

( -180 0 0.31619 )
( -175 0.0254333333333333 0.317321666666667 )
( -170 0.0463166666666667 0.322081666666667 )
( -160 0.0749 0.344691666666667 )
( -155 0.0834166666666667 0.357921666666667 )
( -150 0.0883166666666666 0.371641666666667 )
( -145 0.0900666666666666 0.385408333333333 )
( -140 0.0889 0.398825 )
( -135 0.0852833333333333 0.411565 )
( -130 0.0793333333333334 0.42336 )
( -125 0.0715166666666667 0.434 )
( -120 0.0620666666666667 0.443321666666667 )
( -115 0.0512166666666667 0.451196666666667 )
( -110 0.0393166666666667 0.45752 )
( -105 0.0266 0.46221 )
( -100 0.0133 0.465243333333333 )
( -95 -0.000233333333333333 0.466573333333333 )
( -90 -0.014 0.4662 )
( -85 -0.0275333333333333 0.464135 )
( -80 -0.0407166666666666 0.460413333333333 )
( -75 -0.0532 0.455081666666667 )
( -70 -0.0649833333333333 0.44821 )
( -65 -0.0754833333333332 0.43988 )
( -60 -0.0848166666666667 0.43022 )
( -55 -0.0924 0.41937 )
( -50 -0.0982333333333334 0.407505 )
( -45 -0.101966666666667 0.394858333333333 )
( -40 -0.103366666666667 0.381675 )
( -35 -0.102083333333333 0.368281666666667 )
( -30 -0.0978833333333333 0.35504 )
( -25 -0.0906499999999999 0.342405 )
( -24 -0.0887833333333333 0.33999 )
( -23 -0.0868 0.337633333333333 )
( -22 -0.0845833333333333 0.335323333333333 )
( -21 -0.0823666666666666 0.333071666666667 )
( -20 -0.0799166666666667 0.330878333333333 )
( -19 -0.0772333333333334 0.328848333333333 )
( -18 -0.0740833333333333 0.327051666666667 )
( -17 -0.0705833333333333 0.325476666666667 )
( -16 -0.0666166666666667 0.324111666666667 )
( -15 -0.0623 0.322968333333333 )
( -14 -0.0576333333333334 0.322011666666667 )
( -13 -0.0527333333333334 0.321253333333333 )
( -12 -0.0474833333333333 0.32067 )
( -11 -0.042 0.320261666666667 )
( -10 -0.0362833333333333 0.320028333333333 )
( -8 -0.0242666666666667 0.320016666666667 )
( -6 -0.01295 0.317205 )
( -5.5 -0.0105 0.31633 )
( -5 -0.00839999999999999 0.315548333333333 )
( -4.5 -0.00758333333333333 0.314766666666667 )
( -4 -0.0063 0.313961666666667 )
( -3.5 -0.00198333333333333 0.313238333333333 )
( -3 0.00035 0.312655 )
( -2.5 0.00163333333333333 0.312141666666667 )
( -2 0.00105 0.311476666666667 )
( -1.5 0.000466666666666667 0.31108 )
( -1 0.0042 0.310881666666667 )
( -0.5 0.00851666666666667 0.310765 )
( 0 0.0159833333333333 0.310485 )
( 0.5 0.02485 0.310496666666667 )
( 1 0.0340666666666667 0.310543333333333 )
( 1.5 0.04305 0.31059 )
( 2 0.0518 0.310613333333333 )
( 2.5 0.0599666666666667 0.310613333333333 )
( 3 0.0676666666666667 0.310601666666667 )
( 3.5 0.0752499999999999 0.310566666666667 )
( 4 0.0828333333333334 0.310555 )
( 4.5 0.0905333333333334 0.31059 )
( 5 0.0981166666666666 0.310625 )
( 5.5 0.105466666666667 0.310671666666667 )
( 6 0.112816666666667 0.310741666666667 )
( 6.5 0.119816666666667 0.310846666666667 )
( 7 0.126466666666667 0.31101 )
( 7.5 0.133 0.311196666666667 )
( 8 0.139183333333333 0.311476666666667 )
( 8.5 0.1449 0.311861666666667 )
( 9 0.15015 0.312375 )
( 9.5 0.155516666666667 0.312935 )
( 10 0.1596 0.313751666666667 )
( 10.5 0.163333333333333 0.314708333333333 )
( 11 0.16625 0.315933333333333 )
( 11.5 0.16905 0.317228333333333 )
( 12 0.17185 0.318686666666667 )
( 12.5 0.1743 0.320518333333333 )
( 13 0.176516666666667 0.322338333333333 )
( 13.5 0.179433333333333 0.324193333333333 )
( 14.5 0.18515 0.328416666666667 )
( 15 0.1883 0.330691666666667 )
( 15.5 0.190283333333333 0.333106666666667 )
( 16 0.192383333333333 0.335416666666667 )
( 16.5 0.194366666666667 0.337948333333333 )
( 17 0.196116666666667 0.34048 )
( 17.5 0.198216666666667 0.343 )
( 18 0.20055 0.345578333333333 )
( 19 0.204283333333333 0.35063 )
( 19.5 0.20615 0.353301666666667 )
( 20.5 0.209766666666667 0.358306666666667 )
( 21 0.211166666666667 0.360675 )
( 22 0.2135 0.365516666666667 )
( 23 0.215483333333333 0.370498333333333 )
( 24 0.217116666666667 0.375596666666667 )
( 25 0.2184 0.380811666666667 )
( 26 0.21945 0.386085 )
( 28 0.220966666666667 0.396818333333333 )
( 30 0.222133333333333 0.407645 )
( 32 0.223416666666667 0.418413333333333 )
( 35 0.22505 0.434256666666667 )
( 40 0.222016666666667 0.459351666666667 )
( 45 0.212333333333333 0.481786666666667 )
( 50 0.197166666666667 0.500511666666667 )
( 55 0.177566666666667 0.514605 )
( 60 0.15435 0.523366666666667 )
( 65 0.129033333333333 0.52633 )
( 70 0.102666666666667 0.523215 )
( 75 0.0767666666666666 0.514115 )
( 80 0.0523833333333333 0.49973 )
( 85 0.03115 0.482381666666666 )
( 90 0.0144666666666667 0.471088333333333 )
( 95 0.000233333333333333 0.471473333333333 )
( 100 -0.0137666666666667 0.470108333333333 )
( 105 -0.0274166666666666 0.466993333333333 )
( 110 -0.0406 0.462163333333333 )
( 115 -0.05285 0.455665 )
( 120 -0.06405 0.44758 )
( 125 -0.07385 0.437978333333333 )
( 130 -0.0819 0.427023333333333 )
( 135 -0.0879666666666666 0.414866666666667 )
( 140 -0.0918166666666668 0.401741666666667 )
( 145 -0.0929833333333334 0.387916666666667 )
( 150 -0.0912333333333334 0.373706666666667 )
( 155 -0.0862166666666666 0.359543333333333 )
( 160 -0.0774666666666667 0.345881666666667 )
( 170 -0.0478333333333333 0.322513333333333 )
( 175 -0.0263666666666667 0.317356666666667 )
( 180 0 0.31619 )
); // // // //
